## Plan output

```
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.logging.data.aws_region.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.logging.module.s3.data.aws_partition.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.app["dc-sebt-portal"].module.database["this"].data.aws_rds_engine_version.this: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.rds: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.rds: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.rds: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.rds: Read complete after 0s [id=us-east-1]
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.rds: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].data.aws_lambda_functions.all: Reading...
module.app["df-all-screens-scrape"].data.aws_lambda_functions.all: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.rds: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].data.aws_lambda_functions.all: Reading...
module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_region.current: Reading...
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.secrets.data.aws_caller_identity.identity: Reading...
module.app["dc-sebt-portal"].module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["df-all-screens-scrape"].module.secrets.data.aws_caller_identity.identity: Reading...
module.app["df-all-screens-scrape"].module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["column-sandbox"].module.secrets.data.aws_caller_identity.identity: Reading...
module.app["df-all-screens-scrape"].data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.logging.data.aws_caller_identity.identity: Reading...
module.app["column-sandbox"].module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["dc-sebt-portal"].module.database["this"].data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.database["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.app["dc-sebt-portal"].data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.database["this"].data.aws_caller_identity.identity: Reading...
module.app["column-sandbox"].data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.app["dc-sebt-portal"].module.database["this"].data.aws_region.current: Reading...
module.app["dc-sebt-portal"].module.database["this"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.logging.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.data.aws_lambda_functions.all: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.ecs: Reading...
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.ecs: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 1s [id=816069131564]
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs: Reading...
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.ecs: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.database["this"].data.aws_caller_identity.identity: Read complete after 1s [id=816069131564]
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.ecs: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.secrets.data.aws_region.current: Reading...
module.app["df-all-screens-scrape"].module.secrets.data.aws_region.current: Reading...
module.app["column-sandbox"].module.secrets.data.aws_region.current: Reading...
module.app["dc-sebt-portal"].module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["df-all-screens-scrape"].module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].module.secrets.data.aws_partition.current: Reading...
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.ecs_insights: Reading...
module.app["df-all-screens-scrape"].module.secrets.data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.secrets.data.aws_partition.current: Reading...
module.app["df-all-screens-scrape"].module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.ecs_insights: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs_insights: Reading...
module.app["dc-sebt-portal"].module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 1s [id=816069131564]
module.app["df-all-screens-scrape"].data.aws_cloudwatch_log_groups.ecs_insights: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].data.aws_cloudwatch_log_groups.ecs_insights: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs_insights: Read complete after 0s [id=us-east-1]
module.app["column-sandbox"].data.aws_lambda_function.datadog["this"]: Reading...
module.app["dc-sebt-portal"].data.aws_lambda_function.datadog["this"]: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 1s [id=us-east-1]
module.app["df-all-screens-scrape"].data.aws_lambda_function.datadog["this"]: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 1s [id=o-f5mr0gq6lc]
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.app["column-sandbox"].data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=3580588753]
module.app["df-all-screens-scrape"].data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.app["dc-sebt-portal"].data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=199516603]
module.app["dc-sebt-portal"].module.database["this"].data.aws_rds_engine_version.this: Read complete after 1s [id=16.00.4185.3.v1]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 0s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2856726747]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 1s [id=us-east-1]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.app["column-sandbox"].module.service["web"].data.aws_caller_identity.identity will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "identity" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].data.aws_route53_zone.domain["this"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "domain" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "dev.services.cfa.codes"
      + name_servers               = (known after apply)
      + primary_name_server        = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].data.aws_secretsmanager_secret_version.oidc["this"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_secretsmanager_secret_version" "oidc" {
      + arn            = (known after apply)
      + created_date   = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (sensitive value)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].data.aws_ssm_parameter.version["/column-sandbox/development/web/version"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/column-sandbox/development/web/version"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].data.aws_vpc.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_vpc" "current" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + cidr_block_associations              = (known after apply)
      + default                              = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = (known after apply)
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = "vpc-024d66fcc4f521d0a"
      + instance_tenancy                     = (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + state                                = (known after apply)
      + tags                                 = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].aws_acm_certificate_validation.endpoint["this"] must be replaced
-/+ resource "aws_acm_certificate_validation" "endpoint" {
      ~ id                      = "2025-06-25 22:37:03.708 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_bee017e92c880577144d9f5da5fccbea.column.tax.dev.services.cfa.codes",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.app["column-sandbox"].module.service["web"].aws_iam_role_policy_attachments_exclusive.execution will be updated in-place
  ~ resource "aws_iam_role_policy_attachments_exclusive" "execution" {
      ~ policy_arns = [
          - "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
          + (known after apply),
          + (known after apply),
            # (1 unchanged element hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.app["column-sandbox"].module.service["web"].aws_iam_role_policy_attachments_exclusive.task will be updated in-place
  ~ resource "aws_iam_role_policy_attachments_exclusive" "task" {
      ~ policy_arns = [
          - "arn:aws:iam::aws:policy/AmazonSSMFullAccess",
          - "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
          - "arn:aws:iam::aws:policy/CloudWatchFullAccess",
          + (known after apply),
          + (known after apply),
          + (known after apply),
            # (1 unchanged element hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.app["column-sandbox"].module.service["web"].aws_kms_key.fargate will be updated in-place
  ~ resource "aws_kms_key" "fargate" {
        id                                 = "8bc2c5a7-2c41-4936-8cab-b169367fe4f5"
      ~ policy                             = jsonencode(
            {
              - Id        = "Fargate hosting key policy"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::816069131564:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                  - {
                      - Action    = [
                          - "kms:Decrypt",
                          - "kms:Encrypt",
                          - "kms:GenerateDataKey",
                          - "kms:ReEncrypt*",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "kms:CallerAccount"                 = "816069131564"
                              - "kms:EncryptionContext:aws:ecr:arn" = "arn:aws:ecr:us-east-1:816069131564:repository/column-sandbox-development-web"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow ECR to encrypt container images"
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey*",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow Fargate containers to encrypt objects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags                               = {
            "application"    = "column-sandbox-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/column-sandbox-development/0dv37ryi5as3sa1d9ltzgdqqvc"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "column-sandbox"
        }
        # (12 unchanged attributes hidden)
    }

  # module.app["column-sandbox"].module.service["web"].aws_route53_record.endpoint["this"] must be replaced
-/+ resource "aws_route53_record" "endpoint" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "column.tax.dev.services.cfa.codes" -> (known after apply)
      ~ id                               = "Z088564232NGJRO0LYHKL_column.tax.dev.services.cfa.codes_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "column.tax.dev.services.cfa.codes"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z088564232NGJRO0LYHKL" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.app["column-sandbox"].module.service["web"].aws_route53_record.endpoint_validation["column.tax.dev.services.cfa.codes"] must be replaced
-/+ resource "aws_route53_record" "endpoint_validation" {
      ~ fqdn                             = "_bee017e92c880577144d9f5da5fccbea.column.tax.dev.services.cfa.codes" -> (known after apply)
      ~ id                               = "Z088564232NGJRO0LYHKL__bee017e92c880577144d9f5da5fccbea.column.tax.dev.services.cfa.codes._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_bee017e92c880577144d9f5da5fccbea.column.tax.dev.services.cfa.codes"
      ~ zone_id                          = "Z088564232NGJRO0LYHKL" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.database["this"].aws_kms_key.database will be updated in-place
  ~ resource "aws_kms_key" "database" {
        id                                 = "685dec83-ce64-422e-b69e-1ebddb298a4d"
      ~ tags                               = {
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "environment"    = "development" -> null
          - "program"        = "safety-net" -> null
          - "project"        = "sebt-portal" -> null
        }
      ~ tags_all                           = {
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "program"        = "safety-net" -> null
          ~ "project"        = "sebt-portal" -> "shared-services"
            # (1 unchanged element hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].data.aws_caller_identity.identity will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "identity" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].data.aws_route53_zone.domain["this"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "domain" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "dev.codeforamerica.app"
      + name_servers               = (known after apply)
      + primary_name_server        = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].data.aws_ssm_parameter.version["/sebt-portal/development/web/version"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/sebt-portal/development/web/version"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].data.aws_vpc.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_vpc" "current" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + cidr_block_associations              = (known after apply)
      + default                              = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = (known after apply)
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = "vpc-024d66fcc4f521d0a"
      + instance_tenancy                     = (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + state                                = (known after apply)
      + tags                                 = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].aws_acm_certificate_validation.endpoint["this"] must be replaced
-/+ resource "aws_acm_certificate_validation" "endpoint" {
      ~ id                      = "2025-06-25 05:09:38.587 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_8a3ad4ee116b9bf7bd8ffb8d000d3f28.dc-sebt-portal.dev.codeforamerica.app",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].aws_iam_role_policy_attachments_exclusive.execution will be updated in-place
  ~ resource "aws_iam_role_policy_attachments_exclusive" "execution" {
      ~ policy_arns = [
          - "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
          + (known after apply),
          + (known after apply),
            # (1 unchanged element hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].aws_iam_role_policy_attachments_exclusive.task will be updated in-place
  ~ resource "aws_iam_role_policy_attachments_exclusive" "task" {
      ~ policy_arns = [
          - "arn:aws:iam::aws:policy/AmazonSSMFullAccess",
          - "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
          - "arn:aws:iam::aws:policy/CloudWatchFullAccess",
          + (known after apply),
          + (known after apply),
          + (known after apply),
            # (1 unchanged element hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].aws_kms_key.fargate will be updated in-place
  ~ resource "aws_kms_key" "fargate" {
        id                                 = "4527d3ac-0df9-4d4d-8f02-7f0f22a32b28"
      ~ policy                             = jsonencode(
            {
              - Id        = "Fargate hosting key policy"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::816069131564:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                  - {
                      - Action    = [
                          - "kms:Decrypt",
                          - "kms:Encrypt",
                          - "kms:GenerateDataKey",
                          - "kms:ReEncrypt*",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "kms:CallerAccount"                 = "816069131564"
                              - "kms:EncryptionContext:aws:ecr:arn" = "arn:aws:ecr:us-east-1:816069131564:repository/sebt-portal-development-web"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow ECR to encrypt container images"
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey*",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow Fargate containers to encrypt objects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags                               = {
            "application"    = "sebt-portal-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw"
            "environment"    = "development"
            "program"        = "safety-net"
            "project"        = "sebt-portal"
        }
        # (12 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].aws_route53_record.endpoint["this"] must be replaced
-/+ resource "aws_route53_record" "endpoint" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "dc-sebt-portal.dev.codeforamerica.app" -> (known after apply)
      ~ id                               = "Z0097236342AE196VY5TV_dc-sebt-portal.dev.codeforamerica.app_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "dc-sebt-portal.dev.codeforamerica.app"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z0097236342AE196VY5TV" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].aws_route53_record.endpoint_validation["dc-sebt-portal.dev.codeforamerica.app"] must be replaced
-/+ resource "aws_route53_record" "endpoint_validation" {
      ~ fqdn                             = "_8a3ad4ee116b9bf7bd8ffb8d000d3f28.dc-sebt-portal.dev.codeforamerica.app" -> (known after apply)
      ~ id                               = "Z0097236342AE196VY5TV__8a3ad4ee116b9bf7bd8ffb8d000d3f28.dc-sebt-portal.dev.codeforamerica.app._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_8a3ad4ee116b9bf7bd8ffb8d000d3f28.dc-sebt-portal.dev.codeforamerica.app"
      ~ zone_id                          = "Z0097236342AE196VY5TV" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].data.aws_caller_identity.identity will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "identity" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].data.aws_route53_zone.domain["this"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "domain" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "dev.services.cfa.codes"
      + name_servers               = (known after apply)
      + primary_name_server        = (known after apply)
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].data.aws_secretsmanager_secret_version.oidc["this"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_secretsmanager_secret_version" "oidc" {
      + arn            = (known after apply)
      + created_date   = (known after apply)
      + id             = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (sensitive value)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].data.aws_ssm_parameter.version["/df-all-screens-scrape/development/web/version"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ssm_parameter" "version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + name           = "/df-all-screens-scrape/development/web/version"
      + type           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].data.aws_vpc.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_vpc" "current" {
      + arn                                  = (known after apply)
      + cidr_block                           = (known after apply)
      + cidr_block_associations              = (known after apply)
      + default                              = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = (known after apply)
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = "vpc-024d66fcc4f521d0a"
      + instance_tenancy                     = (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + state                                = (known after apply)
      + tags                                 = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_acm_certificate.endpoint["this"] will be updated in-place
  ~ resource "aws_acm_certificate" "endpoint" {
        id                        = "arn:aws:acm:us-east-1:816069131564:certificate/2481c5e9-f77d-4021-927b-66e2b6d2367a"
      ~ tags                      = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all                  = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_acm_certificate_validation.endpoint["this"] must be replaced
-/+ resource "aws_acm_certificate_validation" "endpoint" {
      ~ id                      = "2025-06-24 00:16:05.511 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_82dce5817c19ad8cb3b0e037966140c2.scrapes.tax.dev.services.cfa.codes",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_cloudwatch_log_group.service will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service" {
        id                = "/aws/ecs/df-all-screens-scrape/development/web"
        name              = "/aws/ecs/df-all-screens-scrape/development/web"
      ~ tags              = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all          = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_iam_policy.execution will be updated in-place
  ~ resource "aws_iam_policy" "execution" {
        id               = "arn:aws:iam::816069131564:policy/df-all-screens-scrape-development-web-execution"
        name             = "df-all-screens-scrape-development-web-execution"
      ~ tags             = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all         = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_iam_policy.secrets will be updated in-place
  ~ resource "aws_iam_policy" "secrets" {
        id               = "arn:aws:iam::816069131564:policy/df-all-screens-scrape-development-web-secrets-access-20250624001607232500000005"
        name             = "df-all-screens-scrape-development-web-secrets-access-20250624001607232500000005"
      ~ tags             = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all         = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_iam_role.execution will be updated in-place
  ~ resource "aws_iam_role" "execution" {
        id                    = "df-all-screens-scrape-development-web-execution"
        name                  = "df-all-screens-scrape-development-web-execution"
      ~ tags                  = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all              = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_iam_role.task will be updated in-place
  ~ resource "aws_iam_role" "task" {
        id                    = "df-all-screens-scrape-development-web-task"
        name                  = "df-all-screens-scrape-development-web-task"
      ~ tags                  = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all              = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_iam_role_policy_attachments_exclusive.execution will be updated in-place
  ~ resource "aws_iam_role_policy_attachments_exclusive" "execution" {
      ~ policy_arns = [
          - "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
          + (known after apply),
          + (known after apply),
            # (1 unchanged element hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_iam_role_policy_attachments_exclusive.task will be updated in-place
  ~ resource "aws_iam_role_policy_attachments_exclusive" "task" {
      ~ policy_arns = [
          - "arn:aws:iam::aws:policy/AmazonSSMFullAccess",
          - "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy",
          - "arn:aws:iam::aws:policy/CloudWatchFullAccess",
          + (known after apply),
          + (known after apply),
          + (known after apply),
            # (1 unchanged element hidden)
        ]
        # (1 unchanged attribute hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_kms_key.fargate will be updated in-place
  ~ resource "aws_kms_key" "fargate" {
        id                                 = "bf069987-fff0-4faa-bfc2-6013fd921c5e"
      ~ policy                             = jsonencode(
            {
              - Id        = "Fargate hosting key policy"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::816069131564:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                  - {
                      - Action    = [
                          - "kms:Decrypt",
                          - "kms:Encrypt",
                          - "kms:GenerateDataKey",
                          - "kms:ReEncrypt*",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "kms:CallerAccount"                 = "816069131564"
                              - "kms:EncryptionContext:aws:ecr:arn" = "arn:aws:ecr:us-east-1:816069131564:repository/df-all-screens-scrape-development-web"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow ECR to encrypt container images"
                    },
                  - {
                      - Action    = [
                          - "kms:GenerateDataKey*",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow Fargate containers to encrypt objects"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags                               = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all                           = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_route53_record.endpoint["this"] must be replaced
-/+ resource "aws_route53_record" "endpoint" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "scrapes.tax.dev.services.cfa.codes" -> (known after apply)
      ~ id                               = "Z088564232NGJRO0LYHKL_scrapes.tax.dev.services.cfa.codes_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "scrapes.tax.dev.services.cfa.codes"
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z088564232NGJRO0LYHKL" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_route53_record.endpoint_validation["scrapes.tax.dev.services.cfa.codes"] must be replaced
-/+ resource "aws_route53_record" "endpoint_validation" {
      ~ fqdn                             = "_82dce5817c19ad8cb3b0e037966140c2.scrapes.tax.dev.services.cfa.codes" -> (known after apply)
      ~ id                               = "Z088564232NGJRO0LYHKL__82dce5817c19ad8cb3b0e037966140c2.scrapes.tax.dev.services.cfa.codes._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_82dce5817c19ad8cb3b0e037966140c2.scrapes.tax.dev.services.cfa.codes"
      ~ zone_id                          = "Z088564232NGJRO0LYHKL" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].aws_ssm_parameter.version["this"] will be updated in-place
  ~ resource "aws_ssm_parameter" "version" {
        id             = "/df-all-screens-scrape/development/web/version"
        name           = "/df-all-screens-scrape/development/web/version"
      ~ tags           = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all       = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.app["column-sandbox"].module.service["web"].module.alb["this"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].module.alb["this"].aws_lb_listener.this["https"] will be updated in-place
  ~ resource "aws_lb_listener" "this" {
        id                                   = "arn:aws:elasticloadbalancing:us-east-1:816069131564:listener/app/col-sbox-development-web/1d511bd9675f0d81/713c7edda598c13f"
        tags                                 = {
            "application"           = "column-sandbox-development"
            "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/column-sandbox-development/0dv37ryi5as3sa1d9ltzgdqqvc"
            "environment"           = "development"
            "program"               = "tax-benefits"
            "project"               = "column-sandbox"
            "terraform-aws-modules" = "alb"
        }
        # (8 unchanged attributes hidden)

      ~ default_action {
          + alpn_policy                                                           = (known after apply)
          + arn                                                                   = (known after apply)
          + certificate_arn                                                       = (known after apply)
          + id                                                                    = (known after apply)
          + load_balancer_arn                                                     = (known after apply)
          + port                                                                  = (known after apply)
          + protocol                                                              = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
          + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
          + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
          + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
          + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
          + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
          + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
          + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
          + routing_http_response_access_control_max_age_header_value             = (known after apply)
          + routing_http_response_content_security_policy_header_value            = (known after apply)
          + routing_http_response_server_enabled                                  = (known after apply)
          + routing_http_response_strict_transport_security_header_value          = (known after apply)
          + routing_http_response_x_content_type_options_header_value             = (known after apply)
          + routing_http_response_x_frame_options_header_value                    = (known after apply)
          + ssl_policy                                                            = (known after apply)
          + tags                                                                  = (known after apply)
          + tags_all                                                              = (known after apply)
          + tcp_idle_timeout_seconds                                              = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.app["column-sandbox"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repository" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImageScanFindings",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:GetLifecyclePolicy",
              + "ecr:GetLifecyclePolicyPreview",
              + "ecr:GetRepositoryPolicy",
              + "ecr:ListImages",
              + "ecr:ListTagsForResource",
            ]
          + sid     = "PrivateReadOnly"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.app["column-sandbox"].module.service["web"].module.ecr["this"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.app["column-sandbox"].module.service["web"].module.ecr["this"].aws_ecr_repository_policy.this[0] will be updated in-place
  ~ resource "aws_ecr_repository_policy" "this" {
        id          = "column-sandbox-development-web"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::816069131564:root"
                        }
                      - Sid       = "PrivateReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.app["column-sandbox"].module.service["web"].module.efs["data"].data.aws_iam_policy_document.policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "policy" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:elasticfilesystem:us-east-1:816069131564:file-system/fs-001458724570ce815",
            ]
          + sid       = "NonSecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientRootAccess",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:elasticfilesystem:us-east-1:816069131564:file-system/fs-001458724570ce815",
            ]
          + sid       = "NonSecureTransportAccessedViaMountTarget"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "true",
                ]
              + variable = "elasticfilesystem:AccessedViaMountTarget"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.app["column-sandbox"].module.service["web"].module.efs["data"].aws_efs_file_system_policy.this[0] will be updated in-place
  ~ resource "aws_efs_file_system_policy" "this" {
        id                                 = "fs-001458724570ce815"
      ~ policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:elasticfilesystem:us-east-1:816069131564:file-system/fs-001458724570ce815"
                      - Sid       = "NonSecureTransport"
                    },
                  - {
                      - Action    = [
                          - "elasticfilesystem:ClientWrite",
                          - "elasticfilesystem:ClientRootAccess",
                          - "elasticfilesystem:ClientMount",
                        ]
                      - Condition = {
                          - Bool = {
                              - "elasticfilesystem:AccessedViaMountTarget" = "true"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:elasticfilesystem:us-east-1:816069131564:file-system/fs-001458724570ce815"
                      - Sid       = "NonSecureTransportAccessedViaMountTarget"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.app["column-sandbox"].module.service["web"].module.endpoint_security_group.aws_security_group_rule.egress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "egress_rules" {
      ~ cidr_blocks              = [ # forces replacement
          - "10.1.0.0/16",
        ] -> (known after apply) # forces replacement
      ~ from_port                = 0 -> -1
      ~ id                       = "sgrule-3301232793" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0be87fb44987bb0fe" -> (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 0 -> -1
        # (7 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.database["this"].module.database_security_group.aws_security_group.this_name_prefix[0] will be updated in-place
  ~ resource "aws_security_group" "this_name_prefix" {
        id                     = "sg-052c720f2d7d35631"
        name                   = "sebt-portal-development-database-20250613191726526800000001"
      ~ tags                   = {
            "Name"           = "sebt-portal-development-database"
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "environment"    = "development" -> null
          - "program"        = "safety-net" -> null
          - "project"        = "sebt-portal" -> null
        }
      ~ tags_all               = {
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "program"        = "safety-net" -> null
          ~ "project"        = "sebt-portal" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.alb["this"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repository" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImageScanFindings",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:GetLifecyclePolicy",
              + "ecr:GetLifecyclePolicyPreview",
              + "ecr:GetRepositoryPolicy",
              + "ecr:ListImages",
              + "ecr:ListTagsForResource",
            ]
          + sid     = "PrivateReadOnly"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].aws_ecr_repository_policy.this[0] will be updated in-place
  ~ resource "aws_ecr_repository_policy" "this" {
        id          = "sebt-portal-development-web"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::816069131564:root"
                        }
                      - Sid       = "PrivateReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.endpoint_security_group.aws_security_group_rule.egress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "egress_rules" {
      ~ cidr_blocks              = [ # forces replacement
          - "10.1.0.0/16",
        ] -> (known after apply) # forces replacement
      ~ from_port                = 0 -> -1
      ~ id                       = "sgrule-2115756838" -> (known after apply)
      ~ security_group_rule_id   = "sgr-048dee6dc0e6f1e21" -> (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 0 -> -1
        # (7 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.secrets.module.secrets_manager["oidc"].aws_secretsmanager_secret.this[0] will be updated in-place
  ~ resource "aws_secretsmanager_secret" "this" {
        id                             = "arn:aws:secretsmanager:us-east-1:816069131564:secret:df-all-screens-scrape/development/oidc-20250623183809209800000001-j7Kc8D"
        name                           = "df-all-screens-scrape/development/oidc-20250623183809209800000001"
      ~ tags                           = {
          + "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
          + "environment"    = "development"
          + "program"        = "tax-benefits"
          + "project"        = "df-all-screens-scrape"
        }
      ~ tags_all                       = {
          + "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
          + "program"        = "tax-benefits"
          ~ "project"        = "shared-services" -> "df-all-screens-scrape"
            # (1 unchanged element hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.alb["this"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.alb["this"].aws_lb.this[0] will be updated in-place
  ~ resource "aws_lb" "this" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:816069131564:loadbalancer/app/df-scrape-development-web/3cf70983c2be0261"
        name                                        = "df-scrape-development-web"
      ~ tags                                        = {
            "application"           = "df-all-screens-scrape-development"
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"           = "development"
            "program"               = "tax-benefits"
            "project"               = "df-all-screens-scrape"
            "terraform-aws-modules" = "alb"
        }
      ~ tags_all                                    = {
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (5 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.alb["this"].aws_lb_listener.this["http"] will be updated in-place
  ~ resource "aws_lb_listener" "this" {
        id                                   = "arn:aws:elasticloadbalancing:us-east-1:816069131564:listener/app/df-scrape-development-web/3cf70983c2be0261/74a8570533695170"
      ~ tags                                 = {
            "application"           = "df-all-screens-scrape-development"
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"           = "development"
            "program"               = "tax-benefits"
            "project"               = "df-all-screens-scrape"
            "terraform-aws-modules" = "alb"
        }
      ~ tags_all                             = {
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.alb["this"].aws_lb_listener.this["https"] will be updated in-place
  ~ resource "aws_lb_listener" "this" {
        id                                   = "arn:aws:elasticloadbalancing:us-east-1:816069131564:listener/app/df-scrape-development-web/3cf70983c2be0261/714130289b18b618"
      ~ tags                                 = {
            "application"           = "df-all-screens-scrape-development"
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"           = "development"
            "program"               = "tax-benefits"
            "project"               = "df-all-screens-scrape"
            "terraform-aws-modules" = "alb"
        }
      ~ tags_all                             = {
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (5 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)

      ~ default_action {
          + alpn_policy                                                           = (known after apply)
          + arn                                                                   = (known after apply)
          + certificate_arn                                                       = (known after apply)
          + id                                                                    = (known after apply)
          + load_balancer_arn                                                     = (known after apply)
          + port                                                                  = (known after apply)
          + protocol                                                              = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
          + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
          + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
          + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
          + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
          + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
          + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
          + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
          + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
          + routing_http_response_access_control_max_age_header_value             = (known after apply)
          + routing_http_response_content_security_policy_header_value            = (known after apply)
          + routing_http_response_server_enabled                                  = (known after apply)
          + routing_http_response_strict_transport_security_header_value          = (known after apply)
          + routing_http_response_x_content_type_options_header_value             = (known after apply)
          + routing_http_response_x_frame_options_header_value                    = (known after apply)
          + ssl_policy                                                            = (known after apply)
          + tags                                                                  = (known after apply)
          + tags_all                                                              = (known after apply)
          + tcp_idle_timeout_seconds                                              = (known after apply)
        } -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.alb["this"].aws_lb_target_group.this["endpoint"] will be updated in-place
  ~ resource "aws_lb_target_group" "this" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:816069131564:targetgroup/df-scrape-development-web-app/12772c19e4c6ddc8"
        name                               = "df-scrape-development-web-app"
      ~ tags                               = {
            "application"           = "df-all-screens-scrape-development"
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"           = "development"
            "program"               = "tax-benefits"
            "project"               = "df-all-screens-scrape"
            "terraform-aws-modules" = "alb"
        }
      ~ tags_all                           = {
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (5 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.alb["this"].aws_security_group.this[0] will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-0db92c069951ad4a9"
        name                   = "df-scrape-development-web-20250624001553188500000004"
      ~ tags                   = {
            "application"           = "df-all-screens-scrape-development"
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"           = "development"
            "program"               = "tax-benefits"
            "project"               = "df-all-screens-scrape"
            "terraform-aws-modules" = "alb"
        }
      ~ tags_all               = {
          + "awsApplication"        = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "repository" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:DescribeImageScanFindings",
              + "ecr:DescribeImages",
              + "ecr:DescribeRepositories",
              + "ecr:GetAuthorizationToken",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:GetLifecyclePolicy",
              + "ecr:GetLifecyclePolicyPreview",
              + "ecr:GetRepositoryPolicy",
              + "ecr:ListImages",
              + "ecr:ListTagsForResource",
            ]
          + sid     = "PrivateReadOnly"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "df-all-screens-scrape-development-web"
        name                 = "df-all-screens-scrape-development-web"
      ~ tags                 = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all             = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.ecr["this"].aws_ecr_repository_policy.this[0] will be updated in-place
  ~ resource "aws_ecr_repository_policy" "this" {
        id          = "df-all-screens-scrape-development-web"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "ecr:ListTagsForResource",
                          - "ecr:ListImages",
                          - "ecr:GetRepositoryPolicy",
                          - "ecr:GetLifecyclePolicyPreview",
                          - "ecr:GetLifecyclePolicy",
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:DescribeRepositories",
                          - "ecr:DescribeImages",
                          - "ecr:DescribeImageScanFindings",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::816069131564:root"
                        }
                      - Sid       = "PrivateReadOnly"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.ecs.aws_ecs_cluster.main will be updated in-place
  ~ resource "aws_ecs_cluster" "main" {
        id       = "arn:aws:ecs:us-east-1:816069131564:cluster/df-all-screens-scrape-development-web"
        name     = "df-all-screens-scrape-development-web"
      ~ tags     = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.endpoint_security_group.aws_security_group.this_name_prefix[0] will be updated in-place
  ~ resource "aws_security_group" "this_name_prefix" {
        id                     = "sg-00877a5fcd34931a2"
        name                   = "df-all-screens-scrape-development-web-endpoint-20250624001552841300000002"
      ~ tags                   = {
            "Name"           = "df-all-screens-scrape-development-web-endpoint"
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all               = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.endpoint_security_group.aws_security_group_rule.egress_rules[0] must be replaced
-/+ resource "aws_security_group_rule" "egress_rules" {
      ~ cidr_blocks              = [ # forces replacement
          - "10.1.0.0/16",
        ] -> (known after apply) # forces replacement
      ~ from_port                = 0 -> -1
      ~ id                       = "sgrule-2236683853" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0c200c0da0cc2e024" -> (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 0 -> -1
        # (7 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.otel_config.aws_ssm_parameter.this[0] will be updated in-place
  ~ resource "aws_ssm_parameter" "this" {
        id             = "/df-all-screens-scrape/development/web/otel"
        name           = "/df-all-screens-scrape/development/web/otel"
      ~ tags           = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all       = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.task_security_group.aws_security_group.this_name_prefix[0] will be updated in-place
  ~ resource "aws_security_group" "this_name_prefix" {
        id                     = "sg-0afad7a99ddfd7952"
        name                   = "df-all-screens-scrape-development-web-endpoint-20250624001552841600000003"
      ~ tags                   = {
            "Name"           = "df-all-screens-scrape-development-web-endpoint"
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all               = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app["column-sandbox"].module.service["web"].module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:816069131564:service/column-sandbox-development-web/column-sandbox-development-web"
        name                               = "column-sandbox-development-web"
        tags                               = {
            "application"    = "column-sandbox-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/column-sandbox-development/0dv37ryi5as3sa1d9ltzgdqqvc"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "column-sandbox"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816069131564:task-definition/column-sandbox-development-web:10" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
        id                                    = "db-AQO5FR4MFE4QXEK44UMOZ5DUYE"
      ~ tags                                  = {
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "environment"    = "development" -> null
          - "program"        = "safety-net" -> null
          - "project"        = "sebt-portal" -> null
        }
      ~ tags_all                              = {
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "program"        = "safety-net" -> null
          ~ "project"        = "sebt-portal" -> "shared-services"
            # (1 unchanged element hidden)
        }
        # (58 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_instance.aws_iam_role.enhanced_monitoring[0] will be updated in-place
  ~ resource "aws_iam_role" "enhanced_monitoring" {
        id                    = "rds-monitoring-role"
        name                  = "rds-monitoring-role"
      ~ tags                  = {
            "Name"           = "rds-monitoring-role"
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "environment"    = "development" -> null
          - "program"        = "safety-net" -> null
          - "project"        = "sebt-portal" -> null
        }
      ~ tags_all              = {
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "program"        = "safety-net" -> null
          ~ "project"        = "sebt-portal" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_parameter_group.aws_db_parameter_group.this[0] will be updated in-place
  ~ resource "aws_db_parameter_group" "this" {
        id           = "sebt-portal-development-20250613181046817500000001"
        name         = "sebt-portal-development-20250613181046817500000001"
      ~ tags         = {
            "Name"           = "sebt-portal-development"
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "environment"    = "development" -> null
          - "program"        = "safety-net" -> null
          - "project"        = "sebt-portal" -> null
        }
      ~ tags_all     = {
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "program"        = "safety-net" -> null
          ~ "project"        = "sebt-portal" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.database["this"].module.mssql["this"].module.db_subnet_group.aws_db_subnet_group.this[0] will be updated in-place
  ~ resource "aws_db_subnet_group" "this" {
        id                      = "sebt-portal-development-20250613164153054600000001"
        name                    = "sebt-portal-development-20250613164153054600000001"
      ~ tags                    = {
            "Name"           = "sebt-portal-development"
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "environment"    = "development" -> null
          - "program"        = "safety-net" -> null
          - "project"        = "sebt-portal" -> null
        }
      ~ tags_all                = {
          - "application"    = "sebt-portal-development" -> null
          - "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw" -> null
          - "program"        = "safety-net" -> null
          ~ "project"        = "sebt-portal" -> "shared-services"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:816069131564:service/sebt-portal-development-web/sebt-portal-development-web"
        name                               = "sebt-portal-development-web"
        tags                               = {
            "application"    = "sebt-portal-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw"
            "environment"    = "development"
            "program"        = "safety-net"
            "project"        = "sebt-portal"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816069131564:task-definition/sebt-portal-development-web:19" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      + force_delete                       = true
        id                                 = "arn:aws:ecs:us-east-1:816069131564:service/df-all-screens-scrape-development-web/df-all-screens-scrape-development-web"
        name                               = "df-all-screens-scrape-development-web"
      ~ tags                               = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all                           = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816069131564:task-definition/df-all-screens-scrape-development-web:9" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.app["column-sandbox"].module.service["web"].module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816069131564:task-definition/column-sandbox-development-web:10" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:816069131564:task-definition/column-sandbox-development-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu               = 256
                  - environment       = []
                  - essential         = true
                  - image             = "816069131564.dkr.ecr.us-east-1.amazonaws.com/column-sandbox-development-web:d4a14d598b02e98ee67c125a5f6637585a5fa9c5"
                  - linuxParameters   = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/column-sandbox/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory            = 512
                  - memoryReservation = 512
                  - mountPoints       = [
                      - {
                          - containerPath = "/app/data"
                          - readOnly      = false
                          - sourceVolume  = "data"
                        },
                    ]
                  - name              = "column-sandbox-development-web"
                  - portMappings      = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets           = [
                      - {
                          - name      = "CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:816069131564:secret:column-sandbox/development/client-20250625210756343900000001-yOhjGs:id::"
                        },
                      - {
                          - name      = "CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:816069131564:secret:column-sandbox/development/client-20250625210756343900000001-yOhjGs:secret::"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
              - {
                  - command          = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - cpu              = 256
                  - environment      = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential        = false
                  - image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/column-sandbox/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "otel-collector"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-east-1:816069131564:parameter/column-sandbox/development/web/otel"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "column-sandbox-development-web" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
        tags                     = {
            "application"    = "column-sandbox-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/column-sandbox-development/0dv37ryi5as3sa1d9ltzgdqqvc"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "column-sandbox"
        }
        # (11 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "data" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-001458724570ce815" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "data"

          + efs_volume_configuration {
              + file_system_id          = "fs-001458724570ce815"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0
            }
        }
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816069131564:task-definition/sebt-portal-development-web:19" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:816069131564:task-definition/sebt-portal-development-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command          = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - cpu              = 256
                  - environment      = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential        = false
                  - image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sebt-portal/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "otel-collector"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-east-1:816069131564:parameter/sebt-portal/development/web/otel"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - cpu               = 256
                  - environment       = [
                      - {
                          - name  = "DATABASE_HOST"
                          - value = "sebt-portal-development-20250613171717133500000001.cxcgye2iuxai.us-east-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DATABASE_PORT"
                          - value = "1433"
                        },
                    ]
                  - essential         = true
                  - image             = "816069131564.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-development-web:dabefb8f502b1dfa0b18bd17e2c780e5c4a69baf"
                  - linuxParameters   = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sebt-portal/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory            = 512
                  - memoryReservation = 512
                  - mountPoints       = []
                  - name              = "sebt-portal-development-web"
                  - portMappings      = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets           = [
                      - {
                          - name      = "DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:816069131564:secret:rds!db-810abc7e-8474-4512-bb79-c1a1bc80a43d-u0v3r9:password::"
                        },
                      - {
                          - name      = "DATABASE_USERNAME"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:816069131564:secret:rds!db-810abc7e-8474-4512-bb79-c1a1bc80a43d-u0v3r9:username::"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "sebt-portal-development-web" -> (known after apply)
      ~ revision                 = 19 -> (known after apply)
        tags                     = {
            "application"    = "sebt-portal-development"
            "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/sebt-portal-development/0015lbmzv6im0turnaqk9d1eyw"
            "environment"    = "development"
            "program"        = "safety-net"
            "project"        = "sebt-portal"
        }
        # (11 unchanged attributes hidden)
    }

  # module.app["df-all-screens-scrape"].module.service["web"].module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816069131564:task-definition/df-all-screens-scrape-development-web:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:816069131564:task-definition/df-all-screens-scrape-development-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu               = 256
                  - environment       = []
                  - essential         = true
                  - image             = "816069131564.dkr.ecr.us-east-1.amazonaws.com/df-all-screens-scrape-development-web:811edd3ec781b6610edf0478f4376c2176ea0f27"
                  - linuxParameters   = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/df-all-screens-scrape/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory            = 512
                  - memoryReservation = 512
                  - mountPoints       = []
                  - name              = "df-all-screens-scrape-development-web"
                  - portMappings      = [
                      - {
                          - containerPort = 9292
                          - hostPort      = 9292
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
              - {
                  - command          = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - cpu              = 256
                  - environment      = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential        = false
                  - image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/df-all-screens-scrape/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "otel-collector"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-east-1:816069131564:parameter/df-all-screens-scrape/development/web/otel"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "df-all-screens-scrape-development-web" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
      ~ tags                     = {
            "application"    = "df-all-screens-scrape-development"
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            "environment"    = "development"
            "program"        = "tax-benefits"
            "project"        = "df-all-screens-scrape"
        }
      ~ tags_all                 = {
          + "awsApplication" = "arn:aws:resource-groups:us-east-1:816069131564:group/df-all-screens-scrape-development/011rjomac9saxuzlhgk9y96pn3"
            # (4 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

Plan: 15 to add, 41 to change, 15 to destroy.

Changes to Outputs:
  ~ apps = {
      ~ column-sandbox        = {
          ~ services   = {
              ~ web = {
                  ~ docker_push                = <<-EOT
                        aws ecr get-login-password --region us-east-1 | docker login --username AWS --password-stdin 816069131564.dkr.ecr.us-east-1.amazonaws.com
                        docker build -t column-sandbox-development-web --platform linux/amd64 .
                        docker tag column-sandbox-development-web:latest 816069131564.dkr.ecr.us-east-1.amazonaws.com/column-sandbox-development-web:latest
                        docker push 816069131564.dkr.ecr.us-east-1.amazonaws.com/column-sandbox-development-web:latest
                    EOT -> (known after apply)
                  ~ endpoint_url               = "column.tax.dev.services.cfa.codes" -> (known after apply)
                    # (6 unchanged attributes hidden)
                }
            }
            # (1 unchanged attribute hidden)
        }
      ~ dc-sebt-portal        = {
          ~ services   = {
              ~ web = {
                  ~ docker_push                = <<-EOT
                        aws ecr get-login-password --region us-east-1 | docker login --username AWS --password-stdin 816069131564.dkr.ecr.us-east-1.amazonaws.com
                        docker build -t sebt-portal-development-web --platform linux/amd64 .
                        docker tag sebt-portal-development-web:latest 816069131564.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-development-web:latest
                        docker push 816069131564.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-development-web:latest
                    EOT -> (known after apply)
                  ~ endpoint_url               = "dc-sebt-portal.dev.codeforamerica.app" -> (known after apply)
                    # (6 unchanged attributes hidden)
                }
            }
            # (1 unchanged attribute hidden)
        }
      ~ df-all-screens-scrape = {
          ~ services   = {
              ~ web = {
                  ~ docker_push                = <<-EOT
                        aws ecr get-login-password --region us-east-1 | docker login --username AWS --password-stdin 816069131564.dkr.ecr.us-east-1.amazonaws.com
                        docker build -t df-all-screens-scrape-development-web --platform linux/amd64 .
                        docker tag df-all-screens-scrape-development-web:latest 816069131564.dkr.ecr.us-east-1.amazonaws.com/df-all-screens-scrape-development-web:latest
                        docker push 816069131564.dkr.ecr.us-east-1.amazonaws.com/df-all-screens-scrape-development-web:latest
                    EOT -> (known after apply)
                  ~ endpoint_url               = "scrapes.tax.dev.services.cfa.codes" -> (known after apply)
                    # (6 unchanged attributes hidden)
                }
            }
            # (1 unchanged attribute hidden)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```